cask_args appdir: '/Applications'

# taps
tap 'caskroom/homebrew-cask' || true
tap 'homebrew/core' || true

# version control
brew 'git'

# languages
brew 'php'
brew 'go'
brew 'rbenv'
brew 'ruby-build'
brew 'node'
brew 'python'

# package managers
brew 'composer'
brew 'yarn'

# editors
brew 'vim'

# utilities
brew 'tmux'
brew 'ctags'
brew 'tree'
brew 'watch'
brew 'direnv'
brew 'z'
brew 'fd'
brew 'ack'
brew 'fzf'
brew 'cmake'
brew 'highlight'
brew 'dos2unix'
brew 'wget'
brew 'spaceman-diff'
brew 'readline'
brew 'jq'

cask 'google-cloud-sdk'
cask 'docker'

brew 'kubernetes-cli'

